# Завантажте датасет за вашим вибором (наприклад, датасет "Tips" або "Planets" з Seaborn або інший публічний датасет).
# Побудуйте графік розподілу кількості споживачів/даних за певний параметр (наприклад, вік, вартість тощо). +

# Побудуйте графіки залежності між різними параметрами. +

# Визначте і виведіть статистичні показники (середнє, медіану, дисперсію тощо) для вибраних параметрів. +

# Реалізуйте програму, яка запитує користувача про введення цілого числа.
# Використовуючи конструкцію try-except, обробте виняток, якщо користувач введе не ціле число.
# Виведіть повідомлення про помилку та попросіть користувача ввести ціле число знову.
# Повторюйте запит користувачу до того часу, поки він не введе коректне ціле число.
# Виведіть на екран повідомлення з введеним цілим числом та подякуйте користувачу за співпрацю. +

# Реалізуйте програму-калькулятор, яка дозволяє користувачу вводити математичні вирази (наприклад, "2 + 3", "5 * 4", "10 / 2" тощо).
# Використовуючи конструкцію try-except, обробте виняток, якщо користувач введе некоректний вираз або вираз, що містить помилку.
# При виникненні помилки, виведіть повідомлення про помилку та попросіть користувача ввести вираз знову.
# Виконайте обчислення виразу та виведіть результат на екран.
# Повторюйте процес запиту та обчислення виразів до того часу, поки користувач не вибере вийти з програми.

import seaborn
import matplotlib.pyplot as plt

titanic_data = seaborn.load_dataset('titanic')
tips_data = seaborn.load_dataset('tips')

def task1():
    plt.figure(figsize=(10, 6))
    seaborn.histplot(data=titanic_data, x='fare', bins=40, kde=True, color="green")

    plt.title("Розподіл цін")
    plt.xlabel("Ціна")
    plt.ylabel("Скільки людей купило")
    plt.show()

# task1()

def task3():
    print(tips_data['total_bill'].describe())

# task3()

# while True:
#     try:
#         user_input = input("Введіть ціле число: ")
#         number = int(user_input)
        
#         print("Ви ввели ціле число:", number)
#         print("Дякуємо за співпрацю!")
#         break
        
#     except ValueError:
#         print("Помилка! Введіть ціле число")


while True:
    try:
        print("""Виберіть дію, введіть число:
1. Додавання (+)
2. Віднімання (-)
3. Множення (*)
4. Ділення (/)
              
5. Вийти
""")
        user_input = input("Введіть номер дії: ")
        number = int(user_input)

        if number == 1:
            input1 = int(input('Введіть перше число: '))
            input2 = int(input('Введіть друге число: '))     

            print(f'Ось результат: {input1 + input2}')

        if number == 2:
            input1 = int(input('Введіть перше число: '))
            input2 = int(input('Введіть друге число: '))     

            print(f'Ось результат: {input1 - input2}')

        if number == 3:
            input1 = int(input('Введіть перше число: '))
            input2 = int(input('Введіть друге число: '))     

            print(f'Ось результат: {input1 * input2}')

        if number == 4:
            input1 = int(input('Введіть перше число: '))
            input2 = int(input('Введіть друге число: '))     

            print(f'Ось результат: {input1 / input2}')

        if number == 5:
            print('Вихід..')
            break
        
    except ValueError:
        print("Помилка! Введіть ціле число")






